Autodesk.Revit.DB.ConicalFace.HalfAngle
Half angle of the surface.

Autodesk.Revit.DB.ConicalFace.Radius(System.Int32)
Radii of the surface.

Autodesk.Revit.DB.ConicalFace.Axis
Axis of the surface.

Autodesk.Revit.DB.ConicalFace.Origin
Origin of the surface.

Autodesk.Revit.DB.ConicalFace
A conical face of a 3d solid or open shell.
Remarks: For details on the parameterization, refer to the documentation for Autodesk.Revit.DB.ConicalSurface.